Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_ГрафикПогашения/РЭЙ_ГрафикПогашения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЭЙ_ГрафикПогашения</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсобоеУсловие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаписи</name>
    <comment>0 - проценты по кредиту, 1 - тело кредита</comment>
    <type>
      <types>EnumRef.РЭЙ_КредитыЗаймы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/РЭЙ_КредитыЗаймы/РЭЙ_КредитыЗаймы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЭЙ_КредитыЗаймы</name>
  <enumValues>
    <name>Тело</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_ГрафикПогашения/ManagerModule.bsl
Функция ПолучитьДанныеДляПечати(КонтрактВЭД) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_ГрафикПогашения.Период КАК Дата,
	|	РЭЙ_ГрафикПогашения.Сумма КАК Сумма,
	|	РЭЙ_ГрафикПогашения.ОсобоеУсловие КАК ОсобоеУсловие
	|ПОМЕСТИТЬ Тело
	|ИЗ
	|	РегистрСведений.РЭЙ_ГрафикПогашения КАК РЭЙ_ГрафикПогашения
	|ГДЕ
	|	РЭЙ_ГрафикПогашения.Договор = &КонтрактВЭД
	|	И РЭЙ_ГрафикПогашения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.РЭЙ_КредитыЗаймы.Тело)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РЭЙ_ГрафикПогашения.Период КАК Дата,
	|	РЭЙ_ГрафикПогашения.Сумма КАК Сумма,
	|	РЭЙ_ГрафикПогашения.ОсобоеУсловие КАК ОсобоеУсловие
	|ПОМЕСТИТЬ Проценты
	|ИЗ
	|	РегистрСведений.РЭЙ_ГрафикПогашения КАК РЭЙ_ГрафикПогашения
	|ГДЕ
	|	РЭЙ_ГрафикПогашения.Договор = &КонтрактВЭД
	|	И РЭЙ_ГрафикПогашения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.РЭЙ_КредитыЗаймы.Проценты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Тело.Дата, Проценты.Дата) КАК Период,
	|	ЕСТЬNULL(Тело.ОсобоеУсловие, Проценты.ОсобоеУсловие) КАК ОсобоеУсловие,
	|	Тело.Дата КАК ТелоДата,
	|	Тело.Сумма КАК ТелоСумма,
	|	Проценты.Дата КАК ПроцентыДата,
	|	Проценты.Сумма КАК ПроцентыСумма
	|ИЗ
	|	Тело КАК Тело
	|		ПОЛНОЕ СОЕДИНЕНИЕ Проценты КАК Проценты
	|		ПО Тело.Дата = Проценты.Дата
	|			И Тело.ОсобоеУсловие = Проценты.ОсобоеУсловие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("КонтрактВЭД", КонтрактВЭД);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("НомерСтроки");
	Таблица.Колонки.Добавить("ВалютаКод");
	Таблица.Колонки.Добавить("ВалютаНаименование");
	текНомерСтроки = 0;
	Для Каждого СтрокаТЧ Из Таблица Цикл
		текНомерСтроки = текНомерСтроки + 1;
		СтрокаТЧ.НомерСтроки = текНомерСтроки;
		СтрокаТЧ.ВалютаКод = КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов.Код;
		СтрокаТЧ.ВалютаНаименование = КонтрактВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов.Наименование;
	КонецЦикла;
	
	Возврат Таблица;
КонецФункции
